
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Вопрос 11: Гибридные эволюционные алгоритмы. Меметический алгоритм. Подход Ламарка и Болдуина. · Ответы на экзаменационные вопросы [Методы оптимизации, Каримов, 2020]</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="12.html" />
    
    
    <link rel="prev" href="10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Введение
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0.html">
            
                <a href="0.html">
            
                    
                    Вопрос 0: Пример билета.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="1.html">
            
                <a href="1.html">
            
                    
                    Вопрос 1: Проектирование. Стадии проектирование. Стандарты, описывающие проектирование. Модели проектирования (каскадная, V-модель, спиральная, альтернативные модели).
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2.html">
            
                <a href="2.html">
            
                    
                    Вопрос 2: САПР. Определение, состав по ГОСТ 23501.101-87. Что автоматизируется при использовании САПР? Что не автоматизируется?.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="3.html">
            
                <a href="3.html">
            
                    
                    Вопрос 3: Параметрическая и структурная оптимизация. Определения. Примеры применения в проектировании.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="4.html">
            
                <a href="4.html">
            
                    
                    Вопрос 4: Топологическая оптимизация. Понятие, область применения. Методы ESO, BESO, SIMP, Level-Set method. Ограничения при использовании топологической оптимизации.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="5.html">
            
                <a href="5.html">
            
                    
                    Вопрос 5: Генетический алгоритм. Определение. Общая схема. Понятие хромосомы, гена, отбора.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="6.html">
            
                <a href="6.html">
            
                    
                    Вопрос 6: Виды кроссовера в генетическом алгоритме.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="7.html">
            
                <a href="7.html">
            
                    
                    Вопрос 7: Виды селекции в генетическом алгоритме.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="8.html">
            
                <a href="8.html">
            
                    
                    Вопрос 8: Бинарное и вещественное кодирование в генетическом алгоритме. Код Грея.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="9.html">
            
                <a href="9.html">
            
                    
                    Вопрос 9: Понятие элитизма. Алгоритм островов. Клеточный ГА.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="10.html">
            
                <a href="10.html">
            
                    
                    Вопрос 10: Эволюционные алгоритмы. Определение. Различия между ЭА и ГА. Генетическое и эволюционное программирование.
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="11.html">
            
                <a href="11.html">
            
                    
                    Вопрос 11: Гибридные эволюционные алгоритмы. Меметический алгоритм. Подход Ламарка и Болдуина.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="12.html">
            
                <a href="12.html">
            
                    
                    Вопрос 12: Многокритериальная оптимизация. Понятие множества Парето, доминируемых и недоминируемых решений. Фронт Парето.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="13.html">
            
                <a href="13.html">
            
                    
                    Вопрос 13: Многокритериальная оптимизация. Метод взвешенной суммы. Метод взвешенной метрики. Генетические алгоритмы.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="14.html">
            
                <a href="14.html">
            
                    
                    Вопрос 14: Метод симплексов.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="15.html">
            
                <a href="15.html">
            
                    
                    Вопрос 15: Метод Хукка-Дживса.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="1_practise.html">
            
                <a href="1_practise.html">
            
                    
                    Практика 1: Генетический алгоритм, бинарное кодирование.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="1_2_practise.html">
            
                <a href="1_2_practise.html">
            
                    
                    Практика 1.2: Генетический алгоритм, скрещивание.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="2_practise.html">
            
                <a href="2_practise.html">
            
                    
                    Практика 2: Генетический алгоритм, вещественное кодирование.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="3_practise.html">
            
                <a href="3_practise.html">
            
                    
                    Практика 3: Метод симплексов.
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="4_practise.html">
            
                <a href="4_practise.html">
            
                    
                    Практика 4: Метод Хукка-Дживса.
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Вопрос 11: Гибридные эволюционные алгоритмы. Меметический алгоритм. Подход Ламарка и Болдуина.</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <hr>
<h1 id="&#x432;&#x43E;&#x43F;&#x440;&#x43E;&#x441;-11-&#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x43D;&#x44B;&#x435;-&#x44D;&#x432;&#x43E;&#x43B;&#x44E;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435;-&#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x44B;-&#x43C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439;-&#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;-&#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;-&#x43B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x430;-&#x438;-&#x431;&#x43E;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430;">&#x412;&#x43E;&#x43F;&#x440;&#x43E;&#x441; 11: &#x413;&#x438;&#x431;&#x440;&#x438;&#x434;&#x43D;&#x44B;&#x435; &#x44D;&#x432;&#x43E;&#x43B;&#x44E;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x435; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x44B;. &#x41C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;. &#x41F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x41B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x430; &#x438; &#x411;&#x43E;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430;.</h1>
<hr>
<h2 id="&#x433;&#x438;&#x431;&#x440;&#x438;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F;-&#x433;&#x430;">&#x413;&#x438;&#x431;&#x440;&#x438;&#x442;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x413;&#x410;</h2>
<p><img src="../resources/imgs/11_1.png" alt=""></p>
<p>&#x41E;&#x434;&#x43D;&#x438;&#x43C; &#x438;&#x437; &#x432;&#x430;&#x436;&#x43D;&#x435;&#x439;&#x448;&#x438;&#x445; &#x43F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432; &#x413;&#x410; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43E;&#x43D;&#x438; &#x43F;&#x440;&#x435;&#x43A;&#x440;&#x430;&#x441;&#x43D;&#x43E; &#x441;&#x43E;&#x447;&#x435;&#x442;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x441; &#x434;&#x440;&#x443;&#x433;&#x438;&#x43C;&#x438; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x430;&#x43C;&#x438; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, &#x43F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x43D;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x43D;&#x44B;&#x445; &#x413;&#x410;. &#x41F;&#x43E;&#x436;&#x430;&#x43B;&#x443;&#x439; &#x441;&#x430;&#x43C;&#x44B;&#x43C; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x43E;&#x43C; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x43D;&#x430;&#x440;&#x44F;&#x434;&#x443; &#x441; &#x433;&#x435;&#x43D;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C;&#x438; &#x43E;&#x43F;&#x435;&#x440;&#x430;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438; &#x432; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x443;&#x44E; &#x431;&#x43B;&#x43E;&#x43A;-&#x441;&#x445;&#x435;&#x43C;&#x443; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;&#x433;&#x43E; &#x413;&#x410;. &#x412; &#x44D;&#x442;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43A; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x43A;&#x443;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &quot;&#x441;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x44C;&quot; &#x435;&#x433;&#x43E; &#x432; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x443; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x443;&#x43C;&#x430; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x432;&#x43D;&#x435;&#x434;&#x440;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x435;&#x433;&#x43E; &#x432; &#x43D;&#x43E;&#x432;&#x443;&#x44E; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x438;&#x44E;. &#x41F;&#x440;&#x438; &#x44D;&#x442;&#x43E;&#x43C; &#x413;&#x410; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x441;&#x442;&#x432;&#x430; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;, &#x432; &#x442;&#x43E; &#x432;&#x440;&#x435;&#x43C;&#x44F; &#x43A;&#x430;&#x43A; &#x44D;&#x432;&#x440;&#x438;&#x441;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x43F;&#x440;&#x438;&#x43C;&#x435;&#x43D;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &quot;&#x44D;&#x43A;&#x441;&#x43F;&#x43B;&#x443;&#x430;&#x442;&#x430;&#x446;&#x438;&#x438;&quot; &#x431;&#x43B;&#x438;&#x436;&#x430;&#x439;&#x448;&#x435;&#x433;&#x43E; &#x43E;&#x43A;&#x440;&#x443;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x441;&#x43E;&#x431;&#x435;&#x439;. &#x412;&#x441;&#x43B;&#x435;&#x434;&#x441;&#x442;&#x432;&#x438;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E; &#x413;&#x410; &#x438; &#x44D;&#x432;&#x440;&#x438;&#x441;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x438;&#x43C;&#x435;&#x44E;&#x442; &#x432;&#x437;&#x430;&#x438;&#x43C;&#x43D;&#x43E; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x44E;&#x449;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430;, &#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x43D;&#x44B;&#x435; &#x413;&#x410; &#x447;&#x430;&#x441;&#x442;&#x43E; &#x43F;&#x440;&#x435;&#x432;&#x43E;&#x441;&#x445;&#x43E;&#x434;&#x44F;&#x442; &#x43F;&#x43E; &#x445;&#x430;&#x440;&#x430;&#x43A;&#x442;&#x435;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A;&#x430;&#x43C; &#x432;&#x445;&#x43E;&#x434;&#x44F;&#x449;&#x438;&#x435; &#x432; &#x43D;&#x435;&#x433;&#x43E; &#x43A;&#x43E;&#x43C;&#x43F;&#x43E;&#x43D;&#x435;&#x43D;&#x442;&#x44B;.</p>
<p>&#x414;&#x440;&#x443;&#x433;&#x43E;&#x439; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x439; &#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x432;&#x43D;&#x435;&#x434;&#x440;&#x435;&#x43D;&#x438;&#x435; &#x430;&#x434;&#x430;&#x43F;&#x442;&#x430;&#x446;&#x438;&#x438; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; &#x413;&#x410;.</p>
<p>&#x41A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x413;&#x410; &#x438; &#x44D;&#x432;&#x440;&#x438;&#x441;&#x442;&#x438;&#x43A; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430; &#x438;&#x441;&#x441;&#x43B;&#x435;&#x434;&#x43E;&#x432;&#x430;&#x43B;&#x43E;&#x441;&#x44C; &#x43C;&#x43D;&#x43E;&#x433;&#x438;&#x43C;&#x438; &#x430;&#x432;&#x442;&#x43E;&#x440;&#x430;&#x43C;&#x438; &#x438; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43E; &#x43C;&#x43D;&#x43E;&#x436;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;, &#x43D;&#x43E; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x440;&#x430;&#x441;&#x43F;&#x440;&#x43E;&#x441;&#x442;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x432;&#x430;:</p>
<ol>
<li>&#x42D;&#x432;&#x43E;&#x43B;&#x44E;&#x446;&#x438;&#x44F; &#x41B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x430; (&#x441;&#x442;&#x440;&#x435;&#x43C;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43A; &#x441;&#x43E;&#x432;&#x435;&#x440;&#x448;&#x435;&#x43D;&#x441;&#x442;&#x432;&#x443;). &#x416;&#x438;&#x440;&#x430;&#x444;&#x430;&#x43C; &#x43F;&#x440;&#x438;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x43D;&#x43E; &#x432;&#x44B;&#x442;&#x44F;&#x433;&#x438;&#x432;&#x430;&#x442;&#x44C; &#x448;&#x435;&#x44E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x434;&#x43E;&#x442;&#x44F;&#x43D;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x43E; &#x43B;&#x438;&#x441;&#x442;&#x44C;&#x435;&#x432;, &#x440;&#x430;&#x441;&#x442;&#x443;&#x449;&#x438;&#x445; &#x443; &#x43D;&#x438;&#x445; &#x43D;&#x430;&#x434; &#x433;&#x43E;&#x43B;&#x43E;&#x432;&#x43E;&#x439;. &#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x438;&#x445; &#x448;&#x435;&#x438; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x44F;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x438;&#x43D;&#x43D;&#x435;&#x435;, &#x432;&#x44B;&#x442;&#x44F;&#x433;&#x438;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F;.</li>
<li>&#x42D;&#x444;&#x444;&#x435;&#x43A;&#x442; &#x411;&#x43E;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430; - &#x415;&#x441;&#x43B;&#x438; &#x43D;&#x435;&#x43D;&#x430;&#x441;&#x43B;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x435; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; (&#x43D;&#x430;&#x43F;&#x440;&#x438;&#x43C;&#x435;&#x440;, &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442;&#x435; &#x43E;&#x431;&#x443;&#x447;&#x435;&#x43D;&#x438;&#x44F;) &#x43E;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x437;&#x43D;&#x44B;&#x43C;, &#x442;&#x43E; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x43F;&#x43E;&#x442;&#x43E;&#x43C;&#x441;&#x442;&#x432;&#x430; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43E;&#x441;&#x43E;&#x431;&#x438; &#x441; &#x43B;&#x443;&#x447;&#x448;&#x435;&#x439; &#x43D;&#x430;&#x441;&#x43B;&#x435;&#x434;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x439; &#x43F;&#x440;&#x435;&#x434;&#x440;&#x430;&#x441;&#x43F;&#x43E;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x44C;&#x44E; &#x43A; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44E; (&#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43D;&#x44B;&#x435; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x435;&#x435; &#x438; &#x43B;&#x443;&#x447;&#x448;&#x435; &#x43D;&#x430;&#x443;&#x447;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x442;&#x430;&#x43A;&#x43E;&#x43C;&#x443; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x44E;).</li>
</ol>
<p>&#x41E;&#x431;&#x430; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442; &#x442;&#x43E;, &#x447;&#x442;&#x43E; &#x43E;&#x441;&#x43E;&#x431;&#x44C; &#x43E;&#x431;&#x443;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x442;&#x435;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x432;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x438; &#x441;&#x432;&#x43E;&#x435;&#x433;&#x43E; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F;.</p>
<h2 id="&#x430;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x44B;-&#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x43D;&#x44B;&#x445;-&#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x43E;&#x432;">&#x410;&#x440;&#x445;&#x438;&#x442;&#x435;&#x43A;&#x442;&#x443;&#x440;&#x44B; &#x433;&#x438;&#x431;&#x440;&#x438;&#x434;&#x43D;&#x44B;&#x445; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x43E;&#x432;</h2>
<ul>
<li>&#x41D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x42D;&#x410; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C; (&#x433;&#x435;&#x43D;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x435;, &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x44F;&#x449;&#x435;&#x435; &#x433;&#x435;&#x43D;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x44B;)</li>
<li>&#x41D;&#x435;&#x439;&#x440;&#x43E;&#x441;&#x435;&#x442;&#x44C; + &#x42D;&#x410;</li>
<li>&#x41D;&#x435;&#x447;&#x435;&#x442;&#x43A;&#x430;&#x44F; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x430; + &#x42D;&#x410;</li>
<li>&#x42D;&#x410; + &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430;</li>
</ul>
<h2 id="&#x43C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439;-&#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;">&#x41C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x439; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;</h2>
<ul>
<li>&#x420;. &#x414;&#x43E;&#x43A;&#x438;&#x43D;&#x437;, &#xAB;&#x42D;&#x433;&#x43E;&#x438;&#x441;&#x442;&#x438;&#x447;&#x43D;&#x44B;&#x439; &#x433;&#x435;&#x43D;&#xBB;,  1976</li>
<li>&#x41C;&#x435;&#x43C;&#x44B; &#x2013; &#x435;&#x434;&#x438;&#x43D;&#x438;&#x446;&#x44B; &#x43A;&#x443;&#x43B;&#x44C;&#x442;&#x443;&#x440;&#x43D;&#x43E;&#x439; &#x438;&#x43D;&#x444;&#x43E;&#x440;&#x43C;&#x430;&#x446;&#x438;&#x438;; &#x438;&#x434;&#x435;&#x438; &#x432; &#x443;&#x43C;&#x430;&#x445; &#x43B;&#x44E;&#x434;&#x435;&#x439;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43F;&#x440;&#x43E;&#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x432; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x438;</li>
<li>&#x41C;&#x435;&#x43C;&#x44B; &#x2013; &#x440;&#x435;&#x43F;&#x43B;&#x438;&#x43A;&#x430;&#x442;&#x43E;&#x440;&#x44B; (&#x43E;&#x431;&#x44A;&#x435;&#x43A;&#x442;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x440;&#x430;&#x437;&#x43C;&#x43D;&#x43E;&#x436;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x43F;&#x443;&#x442;&#x435;&#x43C; &#x43A;&#x43E;&#x43F;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x441;&#x430;&#x43C;&#x438;&#x445; &#x441;&#x435;&#x431;&#x44F;)</li>
<li>&#x41C;&#x435;&#x43C;&#x44B; &#x43F;&#x43E;&#x434;&#x432;&#x435;&#x440;&#x436;&#x435;&#x43D;&#x44B; &#x435;&#x441;&#x442;&#x435;&#x441;&#x442;&#x432;&#x435;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x43E;&#x442;&#x431;&#x43E;&#x440;&#x443;</li>
</ul>
<p>&#x41F;&#x435;&#x440;&#x432;&#x43E;&#x43D;&#x430;&#x447;&#x430;&#x43B;&#x44C;&#x43D;&#x43E; &#x43C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x44B; &#x431;&#x44B;&#x43B;&#x438; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D;&#x44B; &#x43A;&#x430;&#x43A; &#x43E;&#x434;&#x438;&#x43D; &#x438;&#x437; &#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43E;&#x432;
&#x43F;&#x43E;&#x432;&#x44B;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x44D;&#x444;&#x444;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x433;&#x435;&#x43D;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x43E;&#x432;.</p>
<hr>
<p>&#x41F;&#x441;&#x435;&#x432;&#x434;&#x43E;&#x43A;&#x43E;&#x434; &#x43C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x430;:</p>
<pre><code class="lang-pascal"><span class="hljs-keyword">begin</span>
 Pop = Initialize()
 <span class="hljs-keyword">do</span>
  Pop1 = Crossover(Pop)
  Pop2 = Improve(Pop1)
  Pop = Select(Pop2)
 <span class="hljs-keyword">while</span> <span class="hljs-keyword">NOT</span> TerminationCriterion
 return best(Pop)
<span class="hljs-keyword">end</span>
</code></pre>
<hr>
<p>&#x422;&#x435;&#x440;&#x43C;&#x438;&#x43D; &#x43C;&#x435;&#x43C;&#x435;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x430;&#x43B;&#x433;&#x43E;&#x440;&#x438;&#x442;&#x43C;&#x43E;&#x432; &#x431;&#x44B;&#x43B; &#x43F;&#x440;&#x435;&#x434;&#x43B;&#x43E;&#x436;&#x435;&#x43D; &#x434;&#x43B;&#x44F; &#x43E;&#x431;&#x43E;&#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x441;&#x442;&#x43E;&#x445;&#x430;&#x441;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x43E;&#x431;&#x44A;&#x435;&#x434;&#x438;&#x43D;&#x44F;&#x44E;&#x442; &#x432; &#x441;&#x435;&#x431;&#x435; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;, &#xAB;&#x437;&#x430;&#x442;&#x43E;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x445;&#xBB; &#x43F;&#x43E;&#x434;
&#x43A;&#x43E;&#x43D;&#x43A;&#x440;&#x435;&#x442;&#x43D;&#x44B;&#x435; &#x43F;&#x440;&#x430;&#x43A;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x435; &#x437;&#x430;&#x434;&#x430;&#x447;&#x438;, &#x438; &#x43F;&#x43E;&#x43F;&#x443;&#x43B;&#x44F;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x44B;&#x445; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; &#x433;&#x43B;&#x43E;&#x431;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x43E;&#x438;&#x441;&#x43A;&#x430;.
&#x41D;&#x430; &#x441;&#x435;&#x433;&#x43E;&#x434;&#x43D;&#x44F;&#x448;&#x43D;&#x438;&#x439; &#x434;&#x435;&#x43D;&#x44C; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x44B; &#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x437;&#x430;&#x434;&#x430;&#x447;
&#x43A;&#x43E;&#x43C;&#x431;&#x438;&#x43D;&#x430;&#x442;&#x43E;&#x440;&#x43D;&#x43E;&#x439;, &#x43D;&#x435;&#x43F;&#x440;&#x435;&#x440;&#x44B;&#x432;&#x43D;&#x43E;&#x439;, &#x434;&#x438;&#x43D;&#x430;&#x43C;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x438; &#x43C;&#x43D;&#x43E;&#x433;&#x43E;&#x43A;&#x440;&#x438;&#x442;&#x435;&#x440;&#x438;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;.</p>
<h2 id="&#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;-&#x43B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x430;-&#x438;-&#x431;&#x43E;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430;">&#x41F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x41B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x430; &#x438; &#x411;&#x43E;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430;</h2>
<p>&#x41F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x41B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x430;:</p>
<ul>
<li>&#x423;&#x43B;&#x443;&#x447;&#x448;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x444;&#x435;&#x43D;&#x43E;&#x442;&#x438;&#x43F;&#x435; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x44F;&#x442; &#x43A; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x438; &#x433;&#x435;&#x43D;&#x43E;&#x442;&#x438;&#x43F;&#x430;</li>
<li>&#x41B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#x43E;&#x441;&#x43E;&#x431;&#x438; &#x43F;&#x440;&#x438;&#x432;&#x43E;&#x434;&#x438;&#x442; &#x43A; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x44E; &#x435;&#x435; &#x433;&#x435;&#x43D;&#x43E;&#x442;&#x438;&#x43F;&#x430;</li>
</ul>
<p>&#x41F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x411;&#x43E;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430;:</p>
<ul>
<li>&#x41F;&#x440;&#x438; &#x43E;&#x442;&#x431;&#x43E;&#x440;&#x435; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x435; &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x438; &#x43F;&#x440;&#x438;&#x441;&#x43F;&#x43E;&#x441;&#x43E;&#x431;&#x43B;&#x435;&#x43D;&#x43D;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x441;&#x43E;&#x431;&#x438; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x438;</li>
<li>&#x41B;&#x43E;&#x43A;&#x430;&#x43B;&#x44C;&#x43D;&#x430;&#x44F; &#x43E;&#x43F;&#x442;&#x438;&#x43C;&#x438;&#x437;&#x430;&#x446;&#x438;&#x44F; &#xAB;&#x43D;&#x435; &#x43D;&#x430;&#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442;&#x441;&#x44F;&#xBB;</li>
</ul>
<p>&#x421;&#x440;&#x430;&#x432;&#x43D;&#x435;&#x43D;&#x438;&#x435;:</p>
<ul>
<li>&#x41B;&#x430;&#x43C;&#x430;&#x440;&#x43A;&#x438;&#x430;&#x43D;&#x441;&#x43A;&#x438;&#x439; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x434;&#x430;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x443;&#x44E; &#x441;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x44C;</li>
<li>&#x41F;&#x43E;&#x434;&#x445;&#x43E;&#x434; &#x411;&#x430;&#x43B;&#x434;&#x443;&#x438;&#x43D;&#x430; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x438;&#x442;&#x435;&#x440;&#x430;&#x446;&#x438;&#x439;, &#x43D;&#x43E; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x43E;&#x447;&#x43D;&#x43E;&#x435; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x438;&#x435;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="10.html" class="navigation navigation-prev " aria-label="Previous page: Вопрос 10: Эволюционные алгоритмы. Определение. Различия между ЭА и ГА. Генетическое и эволюционное программирование.">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="12.html" class="navigation navigation-next " aria-label="Next page: Вопрос 12: Многокритериальная оптимизация. Понятие множества Парето, доминируемых и недоминируемых решений. Фронт Парето.">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Вопрос 11: Гибридные эволюционные алгоритмы. Меметический алгоритм. Подход Ламарка и Болдуина.","level":"1.13","depth":1,"next":{"title":"Вопрос 12: Многокритериальная оптимизация. Понятие множества Парето, доминируемых и недоминируемых решений. Фронт Парето.","level":"1.14","depth":1,"path":"tickets/12.md","ref":"tickets/12.md","articles":[]},"previous":{"title":"Вопрос 10: Эволюционные алгоритмы. Определение. Различия между ЭА и ГА. Генетическое и эволюционное программирование.","level":"1.12","depth":1,"path":"tickets/10.md","ref":"tickets/10.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex"],"root":"src/","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Times New Roman","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"INTRODUCTION.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Ответы на экзаменационные вопросы [Методы оптимизации, Каримов, 2020]","gitbook":"3.x.x"},"file":{"path":"tickets/11.md","mtime":"2020-01-28T07:52:43.157Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-01-28T07:54:01.656Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

